# Task 1 
- How many columns are there? - 3
- How are they separated? - with commas
- Is there a header on top of the file? - no

## Task 2

In [3]:
import pandas as pd

In [33]:
df = pd.read_csv("./names_per_year/yob2021.txt", header=None, index_col=0)
df

           1      2
0
Olivia     F  17824
Emma       F  15530
Charlotte  F  13352
Amelia     F  13024
Ava        F  12854
...       ..    ...
Zyeire     M      5
Zyel       M      5
Zyian      M      5
Zylar      M      5
Zyn        M      5

[31729 rows x 2 columns]

## Task 3
first 10 rows

In [14]:
df.head(10)

      Olivia  F  17824
0       Emma  F  15530
1  Charlotte  F  13352
2     Amelia  F  13024
3        Ava  F  12854
4     Sophia  F  12559
5   Isabella  F  11288
6        Mia  F  11157
7     Evelyn  F   9484
8     Harper  F   8433
9       Luna  F   8230

## Task 4
display number of rows and columns

In [39]:
df.shape

(31729, 2)

In [40]:
df.info

<bound method DataFrame.info of            1      2
0
Olivia     F  17824
Emma       F  15530
Charlotte  F  13352
Amelia     F  13024
Ava        F  12854
...       ..    ...
Zyeire     M      5
Zyel       M      5
Zyian      M      5
Zylar      M      5
Zyn        M      5

[31729 rows x 2 columns]>

## Task 5
calculate the total number of babies born in 2021 (sum of 3rd col)

In [58]:
int(df[2].sum())

3384687

## Task 6
Sum of male and female babies born by sex

### Number of Male and Female names

In [46]:
df.groupby(1).count()

       2
1
F  17649
M  14080

### Number of male and female babies born

In [75]:
df.groupby(1).sum()

         2
1
F  1638188
M  1746499

## Task 7
Check if my name exists in data set

In [74]:
df[df.index == "Felix"]

       1     2
0
Felix  F    14
Felix  M  1956

## Task 8
Calculate the percentage of girls and boys among the total births

In [93]:
# rounded to one digit because the numbers round up like that (like .399)
(df.groupby(1).sum() / df[2].sum() * 100).round(2)

      2
1
F  48.4
M  51.6

## Task 9
Create a table that contains the top 5 girls names and top 5 boys names

In [104]:
top_5 = df.groupby(1).head()
top_5

           1      2
0
Olivia     F  17824
Emma       F  15530
Charlotte  F  13352
Amelia     F  13024
Ava        F  12854
Liam       M  20391
Noah       M  18884
Oliver     M  14696
Elijah     M  12807
James      M  12452

In [119]:
top_5.pivot(index="1", columns = "1")

KeyError: "None of ['1', '1'] are in the columns"

## Task 10
Write data from task 9 into an excel sheet

In [103]:
top_5.to_excel("top5_baby_names_by_gender.xlsx", sheet_name="Sheet1")